["Lady Helena asked the major to accompany her.", "MacNabb answered that he would order it.", "Lord Glenarvan remarked that the major is absorbed in the smoke of his cigar.", "Lord Glenarvan said the major is an inveterate smoker.", "Lord Glenarvan noted that the major smokes all the time, even in his sleep.", "The major made a sign of assent.", "The passengers descended between‑decks.", "MacNabb remained alone, talking to himself.", "MacNabb never contradicted himself.", "MacNabb stood motionless, gazing back at the wake of the yacht.", "MacNabb enveloped itself in a dense cloud of smoke.", "MacNabb turned a few moments after a contemplation.", "MacNabb met an unknown stranger.", "The stranger was tall, lank, and shriveled.", "The stranger appeared to be about forty years old.", "The stranger had a large, thick head.", "The stranger had a high forehead.", "The stranger had a prominent nose.", "The stranger had a wide mouth.", "The stranger had a blunt chin.", "The stranger wore enormous eye‑glasses.", "The stranger had an indecisive look.", "The stranger had an intelligent, lively appearance.", "The stranger did not look crabbed or stern.", "The stranger was nonchalant and amiable.", "The stranger was a talker.", "The stranger was abstracted.", "The stranger wore a traveling cap.", "The stranger wore stout yellow buskins.", "The stranger wore leather gaiters.", "The stranger wore maroon velvet pantaloons.", "The stranger wore a jacket of maroon velvet.", "The stranger’s jacket had many pockets.", "The pockets were stuffed with note‑books, memoranda, scraps, portfolios, and thousands of articles.", "The stranger carried a telescope.", "The telescope was four feet long.", "The stranger pointed the telescope at the line where sky and water met.", "The stranger lowered the telescope onto the deck.", "The telescope’s joints closed, causing the stranger to be stretched at the foot of the mainmast.", "The stranger called out “Steward!” in a foreign accent.", "Mr. Olbinett approached the stranger.", "Mr. Olbinett worked in the kitchen’s forecastle.", "The stranger claimed to be the passenger of cabin number six.", "Olbinett confirmed his name as Olbinett.", "The stranger said he had eaten nothing for thirty‑six hours.", "The stranger offered Olbinett a biscuit and a glass of sherry.", "The stranger mentioned sleeping for thirty‑six hours.", "The stranger asked Olbinett what time he dined.", "Olbinett answered that he dined at nine o’clock.", "The stranger said it was not yet eight o’clock.", "The stranger queried whether the captain had risen.", "The stranger inquired about the mate.", "The stranger noted the weather was beautiful and wind favorable.", "Captain Mangles appeared at the companion‑way.", "Captain Mangles was called “Captain Burton” by the stranger.", "The stranger introduced himself as the porter of the Scotia.", "The stranger asked if the captain was satisfied with the Scotia.", "Captain Mangles denied being Captain Burton.", "The stranger mistakenly called Captain Mangles “Mr. Burdness.”", "Lord Glenarvan, Lady Helena, and Miss Grant were on deck.", "The stranger greeted Miss Grant, Lady Helena, and Lord Glenarvan.", "Lord Glenarvan asked whom he addressed.", "The stranger revealed he was Jacques Eliacim François"]