["Paganel shouted to the companions that they would cry and howl until tired.", "Paganel issued a dare to Glenarvan to climb the mountain.", "Glenarvan inquired why the mountain was considered taboo.", "The tomb holds the burial of the chief.", "The mountain was declared taboo, making it forbidden to superstitious savages.", "The fugitives sought temporary safety on the mountain.", "Paganel promised they would be beyond the savages' reach in two days.", "Paganel avoided speaking while the major expressed satisfaction.", "Glenarvan and others planned escape without knowing how to do it.", "The geographer rarely spoke, answering questions evasively.", "MacNabb noticed that Paganel had changed.", "Paganel had wrapped himself in a flaxen mantle and appeared gloomy.", "Paganel escaped from the pah after multiple confusions of natives.", "Paganel was captured by a Maori encampment led by Chief Hihy.", "Chief Hihy greeted Paganel with a nasal rub and spoke English fluently.", "Paganel felt he could not move without the chief’s escort.", "Chief Hihy trusted Paganel enough to attach him by strong flaxen ropes.", "Paganel endured captivity for three days.", "During captivity Paganel broke his ropes and fled.", "Paganel witnessed the chief’s burial on Maunganamu mountain.", "Paganel realised the mountain was tabooed because of the burial.", "Paganel decided to seek refuge on the same mountain.", "Paganel and his companions were aware the natives feared climbing.", "Glenarvan awaited Providence to guarantee a favorable outcome.", "Paganel and the others took bearings of the mountain’s paths.", "The ridge connecting Maunganamu to the Wahiti range is a mile long.", "The ridge’s summit is the only practicable route to escape.", "Native shooters used paper wads fired from lower ramparts.", "The paper wads were printed and carried in the wind.", "Glenarvan challenged whether native shots used Bible leaves as wads.", "Captain Mangles claimed the wads carried a promise of God.", "The wads quoted a biblical promise of deliverance.", "Paganel recalled a Psalm verse about God's love and rescue.", "Paganel, Glenarvan, and companions took their steps toward the tomb.", "The mountain’s ground trembled due to subterranean fires generating steam.", "The region beneath is volcanic with underground vents.", "The Maunganamu is one of many cones covering the island’s center.", "The friction of the mountain’s crust was compared to a boiler’s.", "Paganel expressed a desire to leave the peak immediately.", "Lady Helena approached and questioned their hope or fear.", "Glenarvan assured that natives would not ascend the mountain.", "Captain Mangles offered biblical encouragement to hope.", "Paganel described the tomb as a fortress, castle, dining-room, and workshop.", "The tomb’s walls were formed of painted stakes.", "Homages on the stakes depicted deceased nobles’ exploits.", "The tomb floor lay beneath a carpet of green leaves.", "Inside the tomb were weapons of the chief, including guns, a"]